package application

import "lab4/products"

var ProductList = []products.Product{
	{
		Id:          `TaTVGXgG`,
		Name:        `43” Телевизор Tuvio 4К ULTRA HD DLED на платформе Яндекс.ТВ, STV-43FDUBK1R, черный`,
		Description: `Tuvio — это бренд удобной бытовой техники для домашней семейной жизни, придуманный в Яндексе. Телевизор Tuvio Frameless DLED 4K Ultra HD 43" на платформе Яндекс.ТВ превратит комнату в уютное место для отдыха. Пульт с голосовым управлением сделает поиск нужного контента быстрым и удобным. Вам доступны десятки телеканалов, а также сотни фильмов и сериалов из интернета. Благодаря разрешению 4K Ultra HD и увеличенной яркости 260 кд/м2 привычное видео заиграет новыми красками.`,
		Price:       16990,
		ImageUrl:    `https://avatars.mds.yandex.net/get-mpic/4606255/img_id9101966090390502385.jpeg/orig`,
	},
	{
		Id:          `5vlajGm3`,
		Name:        `43" Телевизор Xiaomi Mi TV A2 43 HDR RU, черный`,
		Description: `Конструкция с ультратонкой рамкой обеспечивает высокое соотношение размера экрана и корпуса, значительно превосходящее соотношение стандартных телевизоров. Когда экран включен, практически невозможно заметить границу изображения, что обеспечивает более полное погружение. Благодаря изысканной металлической рамке и цельной конструкции Xiaomi TV A2 станет яркой деталью в любом интерьере. Внедрение стандарта цветового пространства DCI-P3, используемого в голливудской киноиндустрии, для обеспечения реалистичной цветопередачи экрана. Широкое цветовое пространство (WCG) в сочетании с точной калибровкой цвета обеспечивает потрясающую точность цветопередачи. Технология Motion Estimation, Motion Compensation (MEMC) делает изображения с высокой скоростью движения более плавными, обеспечивая просмотр без компромиссов. Это значит, что вы сможете запечатлеть больше прекрасных моментов, будь то спортивные соревнования, боевик или гоночная игра.`,
		Price:       27289,
		ImageUrl:    `https://avatars.mds.yandex.net/get-mpic/1478677/img_id7424156543302459224.jpeg/orig`,
	},
	{
		Id:          `0coqnUk1`,
		Name:        `32" Телевизор Xiaomi Mi TV A2 32 RU, черный`,
		Description: `Благодаря изысканной металлической рамке и цельной конструкции Xiaomi TV A2 станет яркой деталью в любом интерьере. Наслаждайтесь функционалом Smart TV на базе Android TV 11 и встроенным Google Ассистентом. Конструкция с ультратонкой рамкой обеспечивает высокое соотношение размера экрана и корпуса, значительно превосходящее соотношение стандартных телевизоров. Как только вы включаете телевизор, экран заполняется невероятно красочным изображением в высоком разрешении, чтобы вы могли полностью погрузиться в происходящее. 2 стереодинамика мощностью по 10 Вт с технологиями Dolby Audio и DTS Virtual:X Sound наполняют комнату насыщенными высокими и низкими частотами и обеспечивают объемное звучание.`,
		Price:       16260,
		ImageUrl:    `https://avatars.mds.yandex.net/get-mpic/4441663/img_id5253471499399399674.jpeg/orig`,
	},
	{
		Id:          `qHoueB61`,
		Name:        `32" Телевизор Topdevice TV 32" LED SPECIAL, HD 720p, черный`,
		Description: `Классическая модель телевизора диагональю 32 дюйма и тонкой рамкой с возможностью установки, как на горизонтальной поверхности или же на стене с помощью кронштейна, приобретаемого отдельно. Современный эргономичный пульт делает управление простым и удобным. Изображение с разрешением 1366х768 и высокой контрастностью 3000:1 отличается хорошей детализацией и реалистичностью картинки. Яркость панели 200Кд/м2 позволяет наслаждаться просмотром даже при сильной освещенности помещения. В модели предусмотрена обработка сигнала Dolby Audio, а также два встроенных динамика с выходной мощностью по 8 Вт, которые воспроизведут мощный и четкий звук. С помощью имеющихся разъемов HDMI и USB можно подключить к телевизору дополнительные устройства или посмотреть записанные файлы с флэш-карты. Наличие встроенного DVB-T2 тюнера позволит наслаждаться просмотром бесплатных федеральных цифровых каналов. Помимо этого, CI слот и S2 тюнер обеспечат простое подключение спутникового телевидения.`,
		Price:       7500,
		ImageUrl:    `https://avatars.mds.yandex.net/get-mpic/1909520/img_id5485932530331721624.jpeg/orig`,
	},
	{
		Id:          `BUkatvPP`,
		Name:        `24" Телевизор Topdevice TV 24" SMART, HD 720p, Smart TV WildRed, белый`,
		Description: `Компактный и стильный телевизор с диагональю 24 дюйма в белом пластиковом корпусе будет гармонично смотреться в современных светлых интерьерах. Благодаря своим размерам такая модель отлично подойдет для небольших помещений. Разместить TV легко - просто повесьте его на стену или установите на горизонтальную поверхность при помощи устойчивых U-образных ножек. Встроенный Smart TV WildRed откроет доступ к сотням фильмов и сериалов, спортивным трансляциям и телевизионным каналам . Вам больше не придется искать контент на различных сайтах, телевизор сам соберет бесплатную подборку по вашему запросу. Современные графический процессор и разрешение экрана, оптимальное для этой диагонали телевизора, обеспечивают четкое и детализированное изображение. Четырехъядерный Cortex A55 гарантирует быстрый отклик на вводимые команды. Функция дополнительной обработки и улучшения качества звучания Dolby Audio работает над звуком контента, делая его двухмерным, чистым и глубоким. Управляйте телевизором с помощью пульта. На корпусе для удобства располагаются кнопки быстрого доступа к популярным онлайн-кинотеатрам, а так же для дополнительного комфорта в использовании предусмотрена программируемая кнопка, для настройки прямого доступа к вашему любимому сервису. Для подключения дополнительных источников сигнала в корпусе телевизора расположены HDMI и USB разъемы, а их количество позволяет одновременно подключить несколько устройств.`,
		Price:       8857,
		ImageUrl:    `https://avatars.mds.yandex.net/get-mpic/5365919/img_id8424466676359786113.jpeg/orig`,
	},
	{
		Id:          `vLb4ij0l`,
		Name:        `55" Телевизор Xiaomi Mi TV A2 55 HDR RU, черный`,
		Description: `Представленная модель телевизора Xiaomi Mi TV A2 позволит вам получить незабываемое удовольствие от просмотра любимого кинофильма или телевизионной передачи. Размер экрана телевизора составляет 55 дюймов по диагонали, что даёт возможность использовать данную модель в больших помещениях. Этот телевизор может похвастаться также и достаточно высокими техническими характеристиками. Формат матрицы 16:9 и при этом она поддерживает разрешение 3840x2160. На изображении такого характера без проблем можно рассмотреть даже самые мельчайшие детали. Высокая частота обновления экрана, реализованная в Xiaomi Mi TV A2 и составляющая 60 Гц также способствует улучшению качества изображения. Стоит отметить великолепную цветопередачу телевизора, благодаря чему изображение на экране выглядит максимально приближенным к реальности. Для воспроизведения звука в конструкции Xiaomi Mi TV A2 представлены качественные колонки. Наличие в конструкции устройства AV/Ethernet (RJ-45)/HDMI/mini-Джек/USB входов даёт возможность подключать к телевизору широкий спектр электронных приборов и дополнительных аксессуаров. Купить телевизор можно в дом, офис, заведение и т.д. Для удобства пользователя предусмотрена возможность крепления модели на стену. Корпус телевизора Xiaomi Mi TV A2 окрашен в черный цвет. Благодаря лаконичному дизайну представленная модель найдёт своё место в интерьере любого помещения и будет радовать вас своими широкими функциональными возможностями.`,
		Price:       42130,
		ImageUrl:    `https://avatars.mds.yandex.net/get-mpic/1724439/img_id1065185854647876405.jpeg/orig`,
	},
	{
		Id:          `MiITQHg9`,
		Name:        `Телевизор 32" Hyundai H-LED32BS5008 (HD 1366x768, Smart TV) серебристый`,
		Description: `Безрамочный телевизор Hyundai H-LED32BS5008 обладает тонким корпусом и стильным дизайном. Телевизор поддерживает Wi-Fi и Bluetooth, что делает его многофункциональным устройством, комфортным для ежедневного использования. Android TV дает доступ ко всем преимуществам системы, включая управление голосом, просмотр контента, игр и многое другое. Телевизор порадует объемным, громким звуком, вкупе с высоким качеством изображения обеспечивает полное погружение в происходящее на экране. С функцией Time Shift, вы не пропустите любимую программу или чемпионат, ведь в любой момент можно посмотреть запись эфира.`,
		Price:       11990,
		ImageUrl:    `https://avatars.mds.yandex.net/get-mpic/4525599/img_id5177096840370394116.jpeg/orig`,
	},
	{
		Id:          `ejNby8bZ`,
		Name:        `50" Телевизор Xiaomi Mi TV A2 50 RU, черный`,
		Description: `Ультра-узкая рамка обеспечивает высокое соотношение экрана к корпусу, намного превышающее соотношение стандартных телевизоров. Когда дисплей включен, вы вряд ли сможете почувствовать границу изображения и получить более захватывающий визуальный опыт. Благодаря изысканной металлической раме с цельным дизайном, Xiaomi TV A2 Series делает реальное заявление в любом доме. Стандарт киноиндустрии технология Dolby Vision обеспечивает более высокий уровень яркости, контрастности и цвета и отображает больше деталей, делая изображения более яркими.`,
		Price:       32757,
		ImageUrl:    `https://avatars.mds.yandex.net/get-mpic/1626700/img_id2227330153201905519.jpeg/orig`,
	},
	{
		Id:          `cymPueiT`,
		Name:        `32" Телевизор Topdevice TV 32" LED, HD 720p, черный`,
		Description: `Стильная модель телевизора с диагональю 32 дюйма в пластиковом черном корпусе и тонкой рамкой. Удобные ножки, идущие в комплекте, позволят устойчиво разметить телевизор на любой горизонтальной поверхности. При желании его можно повесить на стену с помощью кронштейна, приобретаемого отдельно. Высокая контрастность и яркая панель позволят наслаждаться просмотром даже в сильно освещенном помещении Благодаря технологии Dolby Audio вы получите превосходный насыщенный звук. А его громкость и чистоту обеспечат два динамика с общей мощностью 16 Вт. Подключите к телевизору дополнительные устройства или используйте его в качестве монитора к ноутбуку при необходимости. Для подключения предусмотрены несколько разъемов HDMI и USB, которые можно использовать одновременно. Помимо этого наличие CI слота и S2 тюнера позволяет без проблем подключить спутниковое телевидение. Также телевизор оснащен современным DVB-T2 тюнером для просмотра бесплатных федеральных цифровых каналов.`,
		Price:       8290,
		ImageUrl:    `https://avatars.mds.yandex.net/get-mpic/5236535/img_id6242905676952100529.jpeg/orig`,
	},
	{
		Id:          `8WQtCUwd`,
		Name:        `65" Телевизор TCL 65C635 2022 QLED, HDR, черный`,
		Description: `TCL 65C635 — это телевизор с разрешением 4K, обеспечивающий невероятное качество изображения и превосходный звук с помощью технологии Quantum Dot и звуковой системы ONKYO. Он определенно соответствует всему, чего вы ждете от великолепного телевизора. А решающим фактором здесь является очень простой, быстрый и удобный пользовательский интерфейс системы Google TV. Теперь разбудите свой персонализированный Google TV 65C635, просто сказав «ОК, Google!», и начните удивительное путешествие по смарт-ТВ.`,
		Price:       59990,
		ImageUrl:    `https://avatars.mds.yandex.net/get-mpic/5236407/img_id4620137429971607363.jpeg/orig`,
	},
}
